{
    "id": "b14d8d07-faec-424a-a8be-3ca8a734d0d5",
    "SKU": "000008",
    "interpreter": 1,
    "type": "MULT",
    "language": "python",
    "knowledgeArea": "Dados",
    "category": "Lógica de Programação",
    "subCategory": "Operadores algébricos e lógicos (comparação/conjunção)",
    "level": "Hard", 
    "tagsOrConcepts": ["operadores", "lógicos", "algébricos"],
    "text": [
                "Em uma farmaceútica a quantidade de um certo princípio ativo em um comprimido que pode ser comercializado está na faixa entre 450mg e 550mg.",
                "Dois funcionários proativos do controle de qualidade resolveram ao mesmo tempo escrever códigos para verificar se um dado comprimido pode ser vendido",
                "O primeiro deles usou como expressão do controle 'if (principio > 450 and principio < 550), já o segundo usou como expressão 'if not(principio < 450 or principio > 550).",
                "Em uma reunião com a gerencia, ambos os códigos foram apresentados e uma discussão começou sobre qual dos dois estaria correto sobre a implementação.",
                "Quanto a esse impasse, escolha a alternativa correta"
            ],
    "alternatives": [ 
        {"text" : "O primeiro funcionário está correto, pois a expressão do segundo erra o filtro em casos de principio ativo maiores que 550", "feedback": "A expressão do segundo funcionário filtra adequadamente os casos maiores que 550", "correct" : false},
        {"text" : "O segundo funcionário está correto, pois a expressão do primeiro erra o filtro em ccasos de principio ativo menores que 450", "feedback": "A expressão do segundo funcionário filtra adequadamente os casos menores que 450", "correct" : false},
        {"text" : "Ambos estão corretos, pois logicamente as duas expressões possuem o mesmo valor", "feedback": "Essa alternativa está correta", "correct" : true},
        {"text" : "Ambos estão errados, pois logicamente ambas as expressões tem o valor oposto ao do controle esperado", "feedback": "Na verdade ambas as expressões geram o filtro desejado", "correct" : false},
        {"text" : "Não sei", "feedback": "Você respondeu não sei para essa pergunta", "correct" : false}
     ]
}