{
    "id": "e7245225-a0d6-4289-9673-aefc4c6c05a0",
    "SKU": "000025",
    "interpreter": 1,
    "type": "MULT",
    "language": "NA",
    "knowledgeArea": "Dados",
    "category": "Banco de Dados",
    "subCategory": "MER",
    "level": "Hard", 
    "tagsOrConcepts": ["MER", "leitura de documentação"],
    "text": ["PARA RESPONDER ESTA QUESTÃO VOCÊ PODE CONSULTAR A DOCUMENTAÇÃO DO POSTGRESQL 15",
            "Uma empresa de máquinas de cartão de crédito está desenvolvendo um sistema de transações para uma nova versão da sua máquina",
            "Ela estima que, se a máquina nova tiver o mesmo sucesso que a máquina anterior, eles devem receber cerca de 150 mil transações por dia.",
            "Essas transações serão registradas usando um identificador inteiro único, gerado aleatóriamente e sem colisão dentro da faixa permitida de valores pela modelagem de dados.",
            "Considerando que a empresa deseja que não seja necessário fazer atualização da modelagem de dados para essa coluna durante os próximos 40 anos, pergunta-se",
            "Qual deve ser o tipo de dado escolhido para essa coluna do identificador, que comporte o volume de dados estimados a serem armazenados, consumindo a menor quantidade de bytes?"
        ],
    "alternatives": [ 
        {"text" : "smallint", "feedback": "O campo smallint comporta, considerando valores negativos e positivos, cerca de 65.000 valores, o que seria superado por um dia de execução do sistema", "correct" : false},
        {"text" : "integer", "feedback": "Considerando a faixa negativa e positiva do campo integer, ele seria o mais adequado para comportar os dados sem excesso de armazenamento", "correct" : true},
        {"text" : "bigint", "feedback": "O campo bigint comporta uma faixa de valores da casa de quintilhão de entradas, o que é bastante superior ao volume alterado, consumindo mais memória", "correct" : false},
        {"text" : "serial", "feedback": "O campo serial comporta até 2.147.483.647 valores, e considerando esse numero de transações, o sistema terá mais de 2.150.000.000 entradas", "correct" : false},
        {"text" : "Não sei", "feedback": "Você respondeu não sei para essa pergunta", "correct" : false}
     ]
}