{
    "SKU": "000006",
    "interpreter": 1,
    "type": "VF",
    "language": "NA",
    "tagsOrConcepts":["Cloud"],
    "id": "9d9ab43e-0d42-4609-9499-7e3e127a0835",
    "knowledgeArea": "Cloud",
    "category": "AWS",
    "subCategory": "EC2",
    "level": "Advanced",
    "text":[ 
    "Quando falamos de Amazon EC2 é sempre importante aproveitarmos a sua máxima capacidade garantindo sempre a melhor estratégia de Uso e Custo. Dentro desse contexto, possuímos as instâncias Spot. Elas permitem aproveitar a capacidade não utilizada do EC2 na Nuvem AWS. Em comparação com a definição de preço sob demanda, as instâncias spot oferecem descontos de até 90%. De acordo com as opções abaixo, quais mencionam corretamente as formas de validar que a sua empresa/ambiente segue utilizando Instâncias Spot?"
    ],
    "alternatives": [
        {   "text": "É possível validar através do console AWS indo em EC2. Após, no menu lateral esquerdo, clicar em Grupos de Auto Scaling, selecionar o grupo desejado, e indo na guia detalhes após rolar o cursos para baixo você encontrará `Opções de compra de instâncias e Estratégias de Alocação` mostrando o devido uso de Spot.", 
            "feedback":"Resposta Correta!", 
            "correct":true,
            "id": "9d9ab43e-0d42-4609-9499-7e3e127a0836"
        },
        {   "text": "Quando realizamos o uso de instâncias Spot infelizmente não é possível acompanhar em tempo real a indicação de quais máquinas são ou não desta categoria, visto que por questões de segurança tais máquinas poderão ser interrompidas.", 
            "feedback":"Incorreta. É possível identificar as instâncias do Tipo Spot através dos Grupos de Auto Scaling e/ou listando as EC2 disponíveis dentro da sua conta AWS.", 
            "correct":false,
            "id": "9d9ab43e-0d42-4609-9499-7e3e127a0837"
        },
        {   "text": "Você pode ir no painel da AWS e entrar em EC2. Após, no menu lateral esquerdo, clicar em instâncias. Selecione a desejada e vá na guia Detalhes - Detalhes da Instãncia, entrando na opção Ciclo de vida.", 
            "feedback":"Resposta Correta!.", 
            "correct":true,
            "id": "9d9ab43e-0d42-4609-9499-7e3e127a0838"
        },
        {   "text": "As instâncias Spot são adequadas para analise de dados, trabalhos em lote, processamento em segundo plano e podem ser identificadas facilmente dentro da console AWS, entretanto, as mesmas só estão disponíveis para utilização dentro da região de São Paulo (sa-east).", 
            "feedback":"Incorreta. As instâncias Spot estão disponíveis em todas as regiões da AWS, e seu uso está atrelado diretamente a disponibilidade de uso do EC2.", 
            "correct":false,
            "id": "9d9ab43e-0d42-4609-9499-7e3e127a0839"
        }
    ]
}
