{
  "SKU": "DE-AW-009",
  "interpreter": 1,
  "type": "VF",
  "language": "NA",
  "category": "Observability",
  "subCategory": "SRE",
  "level": "Medium",
  "tagsOrConcepts": [
    "aws",
    "DevOps SRE"
  ],
  "text": [
    "Sobre os Pilares de Observabilidade, quais alternativas abaixo são corretas?"
  ],
  "alternatives": [
    {
      "text": "Métricas são representações numéricas do estado dos sistemas ao longo do tempo. Elas são fundamentais não somente para entender o comportamento dos sistemas, mas também habilitam outra função extremamente importante para o gerenciamento de sistemas complexos: Os alertas.",
      "feedback": "Alternativa correta!",
      "correct": true,
      "id": "d57ada45-d5b4-4812-ae6d-8d77f40b1bf7"
    },
    {
      "text": "Logs são um objeto composto por um timestamp associado à dados que descrevem um evento de qualquer natureza, sempre apenas em formato json.",
      "feedback": "Alternativa falsa. A definição do log citada está correta, porém ele pode ser em qualquer formato - texto, json, binário,  - e não somente em json.",
      "correct": false,
      "id": "580b40fc-a54a-4f80-8c8d-6f7889d7f293"
    },
    {
      "text": "É importante observar que a maioria dos logs, exceto para os registros necessário para efeitos legais e regulatórios, se tornam desnecessários após alguns poucos dias, é importante criar as condições de armazenar uma amostra representativa dos eventos por um período limitado de tempo e também criar as condições para tratar os logs como um fluxo contínuo de eventos e, quando necessário (durante um incidente por exemplo) manipulá-los e extrair as informações necessárias para entender o PORQUÊ dos incidentes.",
      "feedback": "Alternativa correta!",
      "correct": true,
      "id": "9a4509d8-33e8-409c-a52a-41b5a05d9546"
    },
    {
      "text": "Tracing é a capacidade de rastrear o caminho completo da execução de uma requisição ou transação através do sistema. Em sistemas distribuídos, conseguir entender o fluxo das requisições, quais serviços foram acionados e quanto tempo foi gasto em cada um deles, é fundamento para definir ONDE está o problema.",
      "feedback": "Alternativa correta!",
      "correct": true,
      "id": "fa230e6a-634e-4402-bd5d-39acaea2b2f8"
    },
    {
      "text": "Um aspecto importante a ser considerado ao habilitar a captura de logs é que processá-los e armazená-los é bastante custoso e requer um planejamento adequado.",
      "feedback": "Alternativa correta!",
      "correct": true,
      "id": "b1cb73e5-a15e-4808-b70f-6e240d018b50"
    }
  ],
  "id": "2f19e543-9ebe-476d-87bc-e40e31d384be"
}