{
    "SKU": "000028",
    "interpreter": 1,
    "type": "VF",
    "language": "NA",
    "tagsOrConcepts":["Cloud"],
    "id": "96a8a798-ae21-4238-87f8-725bbad7f943",
    "knowledgeArea": "Cloud",
    "category": "AWS",
    "subCategory": "Lambda",
    "level": "Advanced",
    "text":[ 
    "Por padrão, o Lambda executa suas funções em uma Virtual Private Cloud (VPC) interna com conectividade aos serviços da AWS e à Internet. Para acessar os recursos da rede local, é possível configurar sua função para se conectar a uma VPC em sua conta. Os erros de conectividade de rede podem ser originados de problemas na configuração de roteamento de sua VPC. De acordo com o erro abaixo, quais opções melhor descrevem sua causa?",
    "---",
    "Erro: ENILimitReachedException: o limite de interface de rede elástica foi atingido para a VPC da função.",
    "---"],
    "alternatives": [
        {   "text": "O erro demonstrado acima, não faz parte de erros relacionados ao Lambda, mas sim, voltados para configurações de VPC Endpoint na AWS.", 
            "feedback":"Errado. O erro acima mencionado, está atrelado a ter excedido o rate limite de 250 interfaces de rede por VPC dentro da conta.", 
            "correct":false,
            "id": "96a8a798-ae21-4238-87f8-725bbad7f944"
        },
        {   "text": "A cota de serviço padrão é de 350 interfaces de rede por VPC e esse limite não pode ser ajustado. Caso o erro acima ocorra, será necessário abertura de chamado junto ao TAM da conta.", 
            "feedback":"Errado. A cota de serviço padrão é de 250 interfaces de rede por VPC e esse limite pode ser ajustado ou alterado através do Serviço Quota na sua conta AWS.", 
            "correct":false,
            "id": "96a8a798-ae21-4238-87f8-725bbad7f945"
        },
        {   "text": "Quando você conecta uma função Lambda a uma VPC, o Lambda cria uma interface de rede elástica para cada combinação de sub-rede e grupo de segurança anexado à função. A cota de serviço padrão é de 250 interfaces de rede por VPC, e se esse limite for ultrapassado será gerado o erro em questão.", 
            "feedback":"Resposta correta!", 
            "correct":true,
            "id": "96a8a798-ae21-4238-87f8-725bbad7f946"
        },
        {   "text": "A cota de serviço padrão é de 250 interfaces de rede por VPC e esse limite pode ser ajustado ou alterado através do Serviço Quota dentro da sua conta AWS para evitar problemas de limit reached.", 
            "feedback":"Resposta correta!", 
            "correct":true,
            "id": "96a8a798-ae21-4238-87f8-725bbad7f947"
        }
    ]
}
