{
  "SKU": "BE-CS-005",
  "interpreter": 1,
  "type": "VF",
  "language": "csharp",
  "knowledgeArea": "C#",
  "category": "Técnicas de Programação",
  "subCategory": "Coleções",
  "level": "Basic",
  "tagsOrConcepts": [
    "collections"
  ],
  "text": [
    "Coleções são um recurso fundamental em C#. ",
    "Elas nos permitem organizar e manipular dados de forma estruturada. ",
    "Além disso, o C# é uma linguagem orientada a objetos e um dos princípios da POO é o polimorfismo.",
    "Para implementarmos este conceito, uma das maneiras é utilizando interfaces, que são um tipo de contrato que estabelece que a classe que a implementa deverá possuir determinadas características e/ou comportamentos.",
    "Em coleções isso não é diferente, temos interfaces nativas do .NET com as quais podemos implementar nossas próprias coleções para assim podermos percorrê-las por meio de laços de repetição, dentre outras funcionalidades.",
    "Dentre as opções a seguir, selecione qual(ais) é(são) interface(s) de coleções em C#:"
  ],
  "alternatives": [
    {
      "text": "IEnumerable",
      "feedback": "Esta é a interface base para todas as coleções, por meio dela podemos implementar iterações sobre uma coleção",
      "correct": true,
      "id": "4869e93b-62bd-4e36-8c3d-a4896088c8ba"
    },
    {
      "text": "ICollection",
      "feedback": "Esta interface herda de IEnumerable, adicionando elementos, permitindo contar quantos elementos existem na coleção, adicionar e remover itens, verificar a existência de um elemento na coleção, entre outras operações.",
      "correct": true,
      "id": "be101651-7671-4e00-9b74-d3abf2fbaeb1"
    },
    {
      "text": "IDisposable",
      "feedback": "Esta interface é utilizada para realizar liberação de memória pelo Garbage Collector.",
      "correct": false,
      "id": "a96f8497-bc23-441e-907f-29c1e58f1059"
    },
    {
      "text": "IList",
      "feedback": "Esta interface implementa ICollection e IEnumerable e adiciona mais elementos à coleção que a implementa, permitindo inserir e remover elementos em qualquer posição e buscar itens pelo seu índice, sendo esta a interface base de todas as listas.",
      "correct": true,
      "id": "e0f260d6-27e7-485b-8737-afab94c931d9"
    }
  ],
  "id": "9b14051d-0e4c-4496-b7fd-55a324f7aa18"
}