{
    "SKU": "000013",
    "interpreter": 1,
    "type": "VF",
    "language": "NA",
    "tagsOrConcepts":["Cloud"],
    "id": "a65a7228-1326-4f27-97b8-a3be7d9b9516",
    "knowledgeArea": "Cloud",
    "category": "AWS",
    "subCategory": "ECS",
    "level": "Advanced",
    "text":[ 
    "O ECS Circuit Break é uma funcionalidade presente no ECS desde novembro de 2020 que permite ao seu Cluster realizar rollback para a versão anterior uma vez que seu último deploy passa a apontar erros em suas validações. Dentre as opções abaixo, quais você deve considerar ao utilizar esse recurso?"
    ],
    "alternatives": [
        {   "text": "O Circuit Break é compatível apenas com os serviços do Amazon ECS que utilizam a estratégia rolling update (ECS) para atualizar o deployment.", 
            "feedback":"Resposta Correta!", 
            "correct":true,
            "id": "a65a7228-1326-4f27-97b8-a3be7d9b9517"
        },
        {   "text": "A utilização do Circuit Break somente é possível com aplicações na Linguagem Java.", 
            "feedback":"Falso. Atualmente não há nenhum tipo de limitação quanto a linguagem que está subindo as aplicações com o Circuit Break ativado.", 
            "correct":false,
            "id": "a65a7228-1326-4f27-97b8-a3be7d9b9518"
        },
        {   "text": "Quando um serviço atinge um estado estável, o estado de implementação muda para COMPLETED. Se o serviço não atingir um estado estável e o Circuit Break estiver ligado, a implantação fará a transição para um estado FAILED. Uma implantação em um estado FAILED não inicia nenhuma nova tarefa.", 
            "feedback":"Resposta Correta!", 
            "correct":true,
            "id": "a65a7228-1326-4f27-97b8-a3be7d9b9519"
        },
        {   "text": "O Circuit Break possui um tempo limite de 5 minutos para validar se determinada aplicação está Ok ou não. Caso contrário, o mesmo inicia automaticamente o processo de Rollback da versão.", 
            "feedback":"Falso. São realizados um conjunto de verificações de integridade para validar se a aplicação está Ok ou não, e a partir deste ponto, iniciar as tratativas de roteamento daquela versão.", 
            "correct":false,
            "id": "a65a7228-1326-4f27-97b8-a3be7d9b9520"
        }
    ]
}
