{
  "SKU": "BD-MS-003",
  "interpreter": 1,
  "type": "MULT",
  "language": "NA",
  "knowledgeArea": "Banco de Dados",
  "category": "SQL Server",
  "subCategory": "DDL",
  "level": "Medium",
  "tagsOrConcepts": [
    "Criação de chaves primárias e constraints",
    "Identity"
  ],
  "text": [
    "Você está responsável por construir uma lista de tarefas em um sistema já existente.",
    "Segundo o que lhe foi atribuído, deverá realizar inicialmente a criação da tabela chamada TAREFAS",
    "Um dos atributos que essa tabela deve conter, é um identificador único, chamado 'Id', que deve ser a chave primária da tabela.",
    "Este atributo deve ser preenchido automaticamente com valores sequenciais e únicos, iniciando em 10 e contando de 3 em 3.",
    "Considerando apenas esse atributo, qual comando SQL deverá ser executado para a criação dessa tabela?"
  ],
  "alternatives": [
    {
      "text": "CREATE TABLE TAREFAS (Id INT PRIMARY KEY IDENTITY(10, 3 + 3))",
      "feedback": "3 + 3 não é válido para esse contexto, deixando o step em 6. O comando correto é CREATE TABLE TAREFAS (Id INT PRIMARY KEY IDENTITY(10, 3))",
      "correct": false,
      "id": "f50fb69a-4191-4673-8084-824968089d52"
    },
    {
      "text": "CREATE TABLE TAREFAS (Id INT PRIMARY KEY AUTOINCREMENT(10, 1))",
      "feedback": "AUTOINCREMENT não é um comando SQL válido. O comando correto é CREATE TABLE TAREFAS (Id INT PRIMARY KEY IDENTITY(10, 3))",
      "correct": false,
      "id": "f960c3ca-adfa-48e2-882a-8c682d9e0d9b"
    },
    {
      "text": "CREATE TABLE TAREFAS (Id INT PRIMARY KEY IDENTITY(10, 3))",
      "feedback": "Parabéns! O comando correto é CREATE TABLE TAREFAS (Id INT PRIMARY KEY IDENTITY(10, 3))",
      "correct": true,
      "id": "77a840ce-3514-4d73-ab4e-4d19e1de371e"
    },
    {
      "text": "CREATE TABLE TAREFAS (Id INT PRIMARY KEY START=10 SEED=3)",
      "feedback": "START e SEED não são comandos SQL válidos. O comando correto é CREATE TABLE TAREFAS (Id INT PRIMARY KEY IDENTITY(10, 3))",
      "correct": false,
      "id": "cf63500a-e8bf-4296-a984-b5926afb55b4"
    }
  ],
  "id": "a13f9b16-f974-4a31-a45e-a4419e3e4cb7"
}