{
  "SKU": "BD-MS-003",
  "interpreter": 1,
  "type": "MULT",
  "language": "NA",
  "knowledgeArea": "Banco de Dados",
  "category": "SQL Server",
  "subCategory": "DDL",
  "level": "Medium",
  "tagsOrConcepts": [
    "Criação de chaves primárias e constraints"
  ],
  "text": [
    "Você está responsável por construir uma lista de tarefas em um sistema já existente.",
    "Uma tarefa possui um tipo de tarefa, conforme o diagrama abaixo:",
    "![](https://s3-sa-east-1.amazonaws.com/lcpi/009877a9-cca3-4403-90db-1a78fb2664c8.PNG)",
    "No qual, o atributo 'IdTipoTarefa' representa o tipo de tarefa cadastrada na tabela TIPOTAREFA",
    "Considere apenas a criação da tabela TAREFAS, com apenas com o atributo 'IdTipoTarefa' para este exercício.",
    "Qual comando SQL deverá ser executado para a criação dessa tabela?"
  ],
  "alternatives": [
    {
      "text": "CREATE TABLE TAREFAS (IdTipoTarefa INT FROM TIPOTAREFA)",
      "feedback": "FROM TIPOTAREFA é um comando SQL inválido para criação de FKs. O comando correto é CREATE TABLE TAREFAS (IdTipoTarefa INT FOREIGN KEY REFERENCES TIPOTAREFA(Id))",
      "correct": false,
      "id": "e3e8b09c-b674-4281-827f-441d2322e1d6"
    },
    {
      "text": "CREATE TABLE TAREFAS (IdTipoTarefa INT WITH FK TIPOTAREFA(Id))",
      "feedback": "WITH FK é um comando SQL inválido para criação de FKs. O comando correto é CREATE TABLE TAREFAS (IdTipoTarefa INT FOREIGN KEY REFERENCES TIPOTAREFA(Id))",
      "correct": false,
      "id": "991e39cf-b018-4159-acaa-9202aaf7e1ff"
    },
    {
      "text": "CREATE TABLE TAREFAS (IdTipoTarefa INT FOREIGN KEY REFERENCES TIPOTAREFA(Id))",
      "feedback": "Parabéns! O comando correto é CREATE TABLE TAREFAS (IdTipoTarefa INT FOREIGN KEY REFERENCES TIPOTAREFA(Id))",
      "correct": true,
      "id": "12e9f370-2110-4625-928e-bd1857f98f71"
    },
    {
      "text": "CREATE TABLE TAREFAS (IdTipoTarefa INT REFERENCES TIPOTAREFA)",
      "feedback": "É necessário informar a coluna junto ao REFERENCES. O comando correto é CREATE TABLE TAREFAS (IdTipoTarefa INT FOREIGN KEY REFERENCES TIPOTAREFA(Id))",
      "correct": false,
      "id": "7ffc263f-6418-4ed7-b507-acb0670ffcbb"
    }
  ],
  "id": "190766c7-6ffb-4404-ab2e-a94da8c1f383"
}