{
  "SKU": "BD-MS-003",
  "interpreter": 1,
  "type": "MULT",
  "language": "NA",
  "knowledgeArea": "Banco de Dados",
  "category": "SQL Server",
  "subCategory": "DQL",
  "level": "Medium",
  "tagsOrConcepts": [
    "Busca de dados com SELECT",
    "Modificadores de resultado",
    "UNION"
  ],
  "text": [
    "Uma campanha de marketing de uma loja deseja enviar e-mails para todos seus clientes e funcionários.",
    "Sabemos que existe uma tabela chamada 'Cliente' com as colunas 'Nome' e 'Email'.",
    "Sabemos também que existe uma tabela chamada 'Funcionario' com as colunas 'Nome' e 'Email'.",
    "Para esse relatório em específico, devemos buscar todos os registros que estão em ambas as tabelas, unindo os dados, evitando registros duplicados.",
    "Qual comando SQL deverá ser executado para buscar os registros da maneira solicitada?"
  ],
  "alternatives": [
    {
      "text": "SELECT DISTINCT Nome, Email FROM Cliente UNION SELECT DISTINCT Nome, Email FROM Funcionario",
      "feedback": "O DISTINCT irá evitar registros duplicados em cada tabela, porém, não remove os duplicados que estão em tabelas diferentes.",
      "correct": false,
      "id": "bdead801-257c-44d9-a679-d1e5fd298587"
    },
    {
      "text": "SELECT c.Nome, c.Email FROM Cliente c INNER JOIN Funcionario f ON c.Nome = f.Nome",
      "feedback": "O INNER JOIN possibilita que dados de diversas tabelas sejam unidos por chaves, o que não é o cenário proposto.",
      "correct": false,
      "id": "d6bc6279-e908-4d69-bd91-8a9637f81f49"
    },
    {
      "text": "SELECT Nome, Email FROM Cliente UNION SELECT Nome, Email FROM Funcionario",
      "feedback": "Parabéns! O comando correto é SELECT Nome, Email FROM Cliente UNION SELECT Nome, Email FROM Funcionario",
      "correct": true,
      "id": "c44dbf11-314d-4af8-a97b-85be013e3735"
    },
    {
      "text": "SELECT Nome, Email FROM Cliente UNION ALL SELECT Nome, Email FROM Funcionario",
      "feedback": "O UNION ALL não realiza filtro por registros duplicados",
      "correct": false,
      "id": "6be84431-b8ed-44a6-b3a4-e4cc4b12329e"
    }
  ],
  "id": "f886fd19-e210-4cde-bc04-5267924a34c4"
}