{
  "SKU": "BD-MS-003",
  "interpreter": 1,
  "type": "MULT",
  "language": "NA",
  "knowledgeArea": "Banco de Dados",
  "category": "SQL Server",
  "subCategory": "DDL",
  "level": "Basic",
  "tagsOrConcepts": [
    "Alteração e remoção de tabelas",
    "Criação de chaves primárias e constraints"
  ],
  "text": [
    "Você está responsável por construir uma lista de tarefas em um sistema já existente.",
    "Já existe uma tabela chamada TAREFAS, com os atributos Id e Nome.",
    "Será necessário adicionar um novo atributo para controlar se a tarefa já foi concluída ou não.",
    "O atributo deverá ser nomeado como 'Finalizada', conter valores boleanos, ser obrigatório e seu valor padrão é falso.",
    "Qual comando SQL deverá ser executado para a adição dessa nova coluna?"
  ],
  "alternatives": [
    {
      "text": "CHANGE TABLE TAREFAS ADD FIELD Finalizada BIT NOT NULL DEFAULT(0)",
      "feedback": "CHANGE e FIELD não são comandos SQL válidos. O comando correto é ALTER TABLE TAREFAS ADD Finalizada BIT NOT NULL DEFAULT(0)",
      "correct": false,
      "id": "1c2aa1d6-34ff-40a3-a3bb-e085dbf5f0b5"
    },
    {
      "text": "ALTER TABLE TAREFAS ADD COLUMN Finalizada BOOLEAN NOT NULL",
      "feedback": "Não é necessário utilizar 'COLUMN' para adicionar uma nova coluna. O comando correto é ALTER TABLE TAREFAS ADD Finalizada BIT NOT NULL DEFAULT(0)",
      "correct": false,
      "id": "b0961744-e94d-46fd-9254-788efbb3b200"
    },
    {
      "text": "ALTER TABLE TAREFAS ADD Finalizada BIT NOT NULL DEFAULT(0)",
      "feedback": "Parabéns! O comando correto é ALTER TABLE TAREFAS ADD Finalizada BIT NOT NULL DEFAULT(0)",
      "correct": true,
      "id": "7aa4af53-6664-4f91-bc06-3d395ffbc87b"
    },
    {
      "text": "ALTER TABLE TAREFAS ADD Finalizada BIT NOT NULL ALWAYS FALSE",
      "feedback": "ALWAYS FALSE não é um comando SQL válido. O comando correto é ALTER TABLE TAREFAS ADD Finalizada BIT NOT NULL DEFAULT(0)",
      "correct": false,
      "id": "2f126c4f-7bbd-4b89-b1aa-0c3655e9ef1b"
    }
  ],
  "id": "8e9705cd-5342-4b59-8a55-855d967f1620"
}